{
    "Title": "A Glassy Night's Walk",
    "Credits": "Created by Ian Stentz",
    "InitialLocation": "Office",
    "Locations": {
        "Office": {
            "Body": "<b>Office</b><br>You step out from your office building, the skyscraper towering behind you. You realized you had stayed late, but are still surprised by the night sky; the moon is looming directly above you. The city is sprawling with life and energy, people are moving about as normal, although late as it is there's far fewer than usual. As you start to feel the chill in the air, you decide it is best to start your walk home, same as always, by taking a shortcut through the nearby alleyway.",
            "Choices": [
                {
                    "Text": "take the shortcut",
                    "Target": "Alleyway Shortcut"
                }
            ]
        },
        "Alleyway Shortcut": {
            "Body": "<b>Alleyway</b><br>As you pass through the shadows of the alley, the air becomes colder and the world outside sounds muted, like a large pillow has been placed between you and it. \"That's odd,\" you think to yourself, but home is so close that there's no point turning back now.",
            "Choices": [
                {
                    "Text": "continue through",
                    "Target": "Strange Road"
                }
            ]
        },
        "Strange Road": {
            "Body": "<b>Strange Road</b><br>As you emerge from the alleyway, it is immediately apparent that something is very, very, <i>wrong</i>. The air is much, much colder, and though you didn't notice it while walking through the alley it is now frighteningly obvious that everything has gone oh so <i>quiet</i>. You look around. What should normally be a packed city street is currently devoid of any life. Down the road you can see the city square, also seemingly abandoned.<br>Looking above, you can see the night sky is irregular, to say the least. The entire night sky is distorted, like you are looking at it from its reflection in a shattered mirror. You focus on the moon, which appears glossy, like it is a glass marble you could simply pluck from the sky.",
            "AltBody": {
                "Text": "<b>Strange Road</b><br>You're back at the strange road where you first realized the predicament you're in. Not much has changed since you've been here, still empty as usual.<br>Looking above, you can see the night sky is irregular, to say the least. The entire night sky is distorted, like you are looking at it from its reflection in a shattered mirror. You focus on the moon, which appears glossy, like it is a glass marble you could simply pluck from the sky.",
                "Condition": "SR Visited"
            },
            "Choices": [
                {
                    "Text": "set up the mirrors",
                    "Target": "Home",
                    "Conditions": [
                        "Have Mirror A",
                        "Have Mirror B"
                    ]
                },
                {
                    "Text": "continue towards home",
                    "Target": "City Square"
                },
                {
                    "Text": "back to the office",
                    "Target": "Alleyway?"
                }
            ],
            "Tags": [
                "SR Visited"
            ]
        },
        "Alleyway?": {
            "Body": "<b>Alleyway?</b><br>Going back through the alley, you find that you definitely won't be able to return from whence you came so easily. Even though the differences are barely perceptible, the alleyway is definitely not as it was when you passed through it at the beginning of this night. Where it was muted now, it is now perfectly silent, save for yourself. You can hear your own breathing, and if you stay quiet for long enough, the beat of your own heart. The air's colder, too. You wonder if the office building is different, too?",
            "AltBody": {
                "Text": "<b>Alleyway?</b><br>You definitely won't be able to return from whence you came so easily. Though it was harder for this alley to be more empty than it already was, it has somehow managed to be so, so much more empty. Where it was muted now, it is now perfectly silent, save for yourself. You can hear your own breathing, and if you stay quiet for long enough, the beat of your own heart. The air's colder, too.",
                "Condition": "Office? Visited"
            },
            "Choices": [
                {
                    "Text": "to the strange road",
                    "Target": "Strange Road"
                },
                {
                    "Text": "to the office",
                    "Target": "Office?"
                }
            ]
        },
        "Office?": {
            "Body": "<b>Office?</b><br>You were just here, a few minutes ago, and everything was normal. That's why you can hardly believe what it looks like now. The Office is shattered outwards in every direction, shards suspended in midair. It's like it was made out of glass and a bubble burst from the center. Glass and metal hangs, seemingly weightlessly, in midair. A very large shard of glass is nearby, about your size. You can see yourself in its reflection.",
            "AltBody": {
                "Text": "<b>Office?</b><br>You were just here, a few minutes ago, and everything was normal. That's why you can hardly believe what it looks like now. The Office is shattered outwards in every direction, shards suspended in midair. It's like it was made out of glass and a bubble burst from the center. Glass and metal hangs, seemingly weightlessly, in midair. A very large shard of glass is nearby, about your size. You can see yourself in its reflection.",
                "Condition": "Have Mirror A"
            },
            "Choices": [
                {
                    "Text": "collect mirror",
                    "Target": "Mirror A Collection",
                    "Conditions": [
                        "Know Mirrors",
                        "No Mirror A"
                    ] 
                },
                {
                    "Text": "to alleyway",
                    "Target": "Alleyway?"
                }
            ],
            "Tags": [
                "Office? Visited"
            ]
        },
        "Mirror A Collection": {
            "Body": "<b>Collected Mirror!</b><br>As you grab the large shard of glass, it offers no resistance. You drag it out of the air like it's gliding along ice. You look kind of silly carefully carrying it around under your arm, but it'll have to do.",
            "Items": [
                {
                "Name": "mirrora",
                "Amount": 1
                }
            ],
            "Choices": [
                {
                    "Text": "continue",
                    "Target": "Office?"
                }
            ]
        },
        "Mirror B Collection": {
            "Body": "<b>Collected Mirror!</b><br>You grab some of the gel. As you pick it up, you are surprised to find it is not sticky at all. Though its cohesion is great, its adhesion is seemingly nonexistent. You unthinkingly experiment with it in your hands, as you would with slime or oobleck. As it is stretched and deformed, it does not seem to have any desire to return to its previous form, staying as you mold it like clay, but losing none of its luster. Perhaps it would make a super material if you took it back to earth? No, you have no idea what would happen if you tried to bring it home with you, you'll be lucky enough to be able to hopefully make it home, might as well count your blessings. You ditch that thought and take only as much as you need.",
            "Items": [
                {
                "Name": "mirrorb",
                "Amount": 1
                }
            ],
            "Choices": [
                {
                    "Text": "continue",
                    "Target": "The Weeping Spire"
                }
            ]
        },
        "City Square": {
            "Body": "<b>City Square</b><br>The city square, which even at this time of night should be bustling as the hub of the city, is completely and utterly empty. It's a strange feeling as a city dweller - the realization that you can walk in, around, and over the asphalt intersection, and not fear being hit by a car. You look down the road, expecting to see the way to your house. Instead, the road along that path is twisted into the air, upside down, to one side, to the other, branching, splitting, converging, convening, flowing, infinitely expanding. It does not seem to have any abidance for gravity, nor any care to start obeying the laws. As you step into the middle of the intersection, you flinch when you notice something moving from the bottom corner of your eyes. You nearly leap backwards, only to find that there's no one there. Just a strangely dark puddle, a deep indigo hue, bubbling at the perfect centerpoint of the intersection. This place seems to be growing stranger by the minute.", 
            "AltBody": {
                "Text":"The city square, still as empty as the last... You've lost track of how many times you've been taken back here by those damnable roads. In the center of the interesection is the stranger, staying very (but not perfectly) still as it waits for you.",
                "Condition": "Starch given"
            },
            "Choices": [
                {
                    "Text": "look at puddle",
                    "Target": "Puddle",
                    "Type": "Dialogue",
                    "Conditions": [
                        "Starch not given"
                    ]
                },
                {
                    "Text": "regard the stranger",
                    "Target": "Stranger",
                    "Type": "Dialogue",
                    "Conditions": [
                        "Starch given"
                    ]
                },
                {
                    "Text": "to strange road",
                    "Target": "Strange Road"
                },
                {
                    "Text": "to the winding roads",
                    "Target": "The Winding Roads",
                    "Type": "RandomExit"
                }
            ]
        },
        "The Winding Roads": {
            "Body": "<b>The Winding Roads</b><br>Space here seems to be warping, twisting. As you walk along this road you feel as if you at are at the whim of this world, unable to make sense of direction. Normally your home should be just beyond this road, as well as that bakery that you visit so frequently. Now, though, you can't seem to find any sense in these paths, not even the way back. Oh well, best to continue on and see where it takes you.",
            "Choices": [
                {
                    "Text": "you find yourself at...",
                    "Targets": [
                        "The Bakery?",
                        "Home?",
                        "The Weeping Spire",
                        "City Square"
                    ]
                }
            ]
        },
        "The Bakery?": {
            "Body": "<b>Bakery</b><br>The bakery is quiet, unnervingly so. The air is still, dust lingers in the air, the light bouncing and refracting off of the particles, leaving the room with an ephemeral, dream-like look. Upon the counter stands a single container. Its label reads \"STARCH\" in big letters.",
            "AltBody": {
                "Text": "<b>Bakery</b><br>The bakery is quiet, unnervingly so. Without the starch container on the counter, it feels all the emptier.",
                "Condition": "Starch Collected"
            },
            "Choices": [
                {
                    "Text": "take starch",
                    "Target": "Starch Collect",
                    "Conditions": [
                        "Starchless Condition"
                    ]
                },
                {
                    "Text": "return to city square",
                    "Target": "City Square"
                }
            ]
        },
        "Starch Collect": {
            "Body": "<b>Collected Starch!</b><br>You pick up the starch, figuring it useful, you suppose. You hope it will come in handy down the line so you won't seem foolish.",
            "Items": [
                {
                "Name": "starch",
                "Amount": 1
                }
            ],
            "Choices": [
                {
                    "Text": "continue",
                    "Target": "The Bakery?"
                }
            ]
        },
        "Home?": {
            "Body": "<b>Home?</b><br>The winding roads have managed to take you back to the place you wanted to go! Home at least. Except... this does not feel like your home. No, not at all. The light is out indoors, and there is no love nor welcomeness from the doors. You don't even feel like stepping inside, something just doesn't feel right.",
            "Choices": [
                {
                    "Text": "return to city square",
                    "Target": "City Square"
                }
            ]
        },
        "The Weeping Spire": {
            "Body": "<b>The Weeping Spire</b><br>Your immediate thought is not too dissimilar from the thoughts you've already been having while you've been in this <i>place</i>: this is WEIRD. In front of you lies a tower stretching far heavenward. As it reaches up, up, up further still, it twists, spiraling like DNA. Its frame is built from twisted steel beams and warped glass, though the windows are too dark to see in, too dark to even see your own reflection. Upon closer inspection, their are divets chiseled into the metal beams. Though you wonder what these are for, you are not left wondering for very long. Seeping into view, globs of a deep blue gel are flowing slowly and viscously within the divets, like sweat or maybe tears. Looking ahead, the divets seem to end at holes in the ground, where the gel will drain into. It seems like a constant process, and though you can not see into the holes, you feel as if somehow they wick the gel back to the top.",
            "Choices": [
                {
                    "Text": "collect gel",
                    "Target": "Mirror B Collection",
                    "Conditions": [
                        "Know Mirrors",
                        "No Mirror B"
                    ] 
                },
                {
                    "Text": "return to city square",
                    "Target": "City Square"
                }
            ]
        },
        "Home": {
            "Body": "<b>Home.</b><br>You push the shard and adjust it to be vertical and facing you, turned 45 degress to the right. You stretch the gel out into a useful shape, large enough to fit you. As you put everything in place, you see your true reflection. You raise your right hand, and instead of raising the hand across like you are so used to, your reflection raises the hand opposite. You notice you hair is parted on the other side now. As you prepare to cross, your thoughts linger on the stranger. \"What will it do now that it has half a body?\" You realize that it's not up to you anymore. You take a deep breath in, close your eyes, cross your fingers, and then put one foot in front of the other. As you make contact with the mirror, you feel stretched and then squashed and then stretched again. You take the rest of your body through. And when you open your eyes, you look down to see all of yourself, completely intact. You're now facing opposite to the way you entered, and when you turn around, there is no mirror behind you. Your ears slowly readjust, and you hear quiet, but not silent. There's people! You run out of the alleyway towards home, seeing that the city square is back to normal, people and all! You slow to a walk, shedding tears of joy. You look up. The stars are normal, and the moon is high above. You're not sure how long you've been gone. You heave a long sigh, drinking in the normality for a little while longer. When you are at last content, you start to walk home. You take a perfectly normal road, and pass by a regular bakery that will be stocked tomorrow with fresh pastries and baked goods.You make it to your house, unlock the door, take off your shoes, lock the door behind you, and flop down on your bed, so exhausted you shortly fall to asleep, work clothes and all. You sleep for 14 hours that night dreamlessly, thankful it was a Friday."
        }
    },
    "Dialogue": {
        "Puddle": {
            "InitialNode": "Start Dialogue",
            "Start Dialogue": {
                "Body": "<b>Puddle</b><br>As you step closer to the puddle, you notice its bubbling is much more regular than you thought... It pulsates, in, then out, then in, then out, with perfect rhythm, its very own heartbeat.<br>Even though it is just a mass of dark indigo fluid, you can't seem to shake the feeling that its... watching you? At least in some definition of the word, it is observing you. Is it living?",
                "AltBody": {
                    "Text":"<b>Puddle</b><br>You see the puddle again, its pulsating still deeply unsettling to you. It is still observing you, waiting for you to speak first.",
                    "Condition": [
                        "Talked to puddle"
                    ]
                },
                "Choices": [
                    {
                        "Text": "\"Hello?\"",
                        "Target": "talkA1",
                        "Conditions": [
                            "Not talked to puddle"
                        ]
                    },
                    {
                        "Text": "\"Hello?\"",
                        "Target": "talkB",
                        "Conditions": [
                            "Talked to puddle"
                        ]
                    },
                    {
                        "Text": "return to city square",
                        "Target": "City Square",
                        "Type": "Location"
                    }
                ]
            },
            "talkA1": {
                "Body": "As you say that, the puddle seems to focus completely on you. It bubbles and boils, and as the bubbles pop, a voice is heard, raspy but lacking any signifiers of gender, hometown, community, or identity otherwise. It forms intelligible words, somehow, \"Hello there, flesh, you seem like you're a bit lost, aren't you?\"",
                "Choices": [
                    {
                        "Text": "Seeing nothing to lose and everything to gain, you nod.",
                        "Target": "talkA2"
                    }
                ]
            },
            "talkA2": {
                "Body": "It seems to notice and understand that gesture. It's... thinking? And then it responds again, \"I think you're in luck, friend. I happen to know a lot about this place, and how a creature with hands like you could leave it.\" You give it a quizical look. \"But I don't just do favors for free, see. I'll need something from you first.\"",
                "Choices": [
                    {
                        "Text": "You eye it suspiciously, after all, what could it want that you could provide?",
                        "Target": "talkA3"
                        
                    }
                ]
            },
            "talkA3": {
                "Body": "\"I need to be something more than what I am right now. I don't know if you've noticed, but I'm a puddle. Not the nicest business, I'll tell you that much and spare you the rest of the sob story. Problem is, I can't really do much about it in this current state, kind of a key-behind-the-lock type situation.\"",
                "Choices": [
                    {
                        "Text": "\"What do you think I can do, then?\"",
                        "Target": "talkA4"
                    }
                ]
            },
            "talkA4": {
                "Body": "\"I'm not quite sure. I think I need some kind of thickenening agent, maybe? Like carrageenan, or some sort of polymer. Trouble is, I don't know where you could find one. Blood's not good enough, nor is that disgusting gel from the spire. I would try back where you came from, but I know it's probably not there. Most things that are still here untouched are beyond the Winding Roads. Problem is, traveling it can spit you out in at least 3 different locations, in addition to bringing you right back to here. It's your best bet though, so if you can find something and bring it back here, I'll tell you what I know.\"",
                "Choices": [
                    {
                        "Text": "\"Here, I already have some starch, actually\"",
                        "Target": "Give Starch",
                        "Conditions": [
                            "Have starch"
                        ]
                    },
                    {
                        "Text": "You depart to the city square in search of a thickener.",
                        "Target": "City Square",
                        "Type": "Location"
                    }
                ],
                "Tags": [
                    "Talked to puddle"
                ]
            },
            "talkB": {
                "Body": "<b>Puddle</b><br>The puddle looks to you again. \"Hey, you got what I need yet?\"",
                "Choices": [
                    {
                        "Text": "give starch",
                        "Target": "Give Starch",
                        "Conditions": [
                            "Have starch"
                        ]
                    },
                    {
                        "Text": "exit",
                        "Target": "City Square",
                        "Type": "Location"
                    }
                ]
            },
            "Give Starch": {
                "Body": "<b>Puddle</b><br>As you pull out the container of starch, you feel a sudden burst of emotion from the puddle. You hadn't noticed before how emotionless it had been, but now, seeing how positively enthused it is, it's obvious what a world of difference it was. \"Finally, at long last! Please, pour it on me! -but please don't stir it, though, that would hurt. I'm not a soup.\" Weird as it's making this, you decide to pour the starch on, seeing no alternative. The puddle starts to congeal to itself, and bubbles that continue to rise stop popping.",
                "Choices": [
                    {
                        "Text": "wait",
                        "Target": "Stranger",
                        "Type": "NewDialogue"
                    },
                    {
                        "Text": "exit",
                        "Target": "City Square",
                        "Type": "Location"
                    }
                ],
                "Tags": [
                    "Starch given"
                ]
            }
        },
        "Stranger": {
            "InitialNode": "Start Dialogue",
            "Start Dialogue": {
                "Body": "<b>The Stranger</b><br>The puddle bubbles over, swelling up from the ground. Two extrusions pour off from the side as one bubble on top grows particularly large. The extrusions form thinner, more defined, and their ends split off into 5 digits. The bubble on top forms into the oblong shape of a head. A mouth forms, but it is not followed by any other features. The puddle is now the upper part of a torso, its arms on the ground like it is holding up the lower half of a body under the pavement. It smiles to itself, a genuine smile, clearly thankful of your actions. \"Oh wow, it is really nice to finally have arms. I can not express enough my gratitude, so please, if there's anything you need, please, ask away.\"",
                "AltBody": {
                    "Text": "<b>The Stranger</b><br>The stranger is sitting there, smiling and clearly thankful of your help. \"Anything else I can help you with?\"",
                    "Condition": "Talked to stranger"
                },
                "Choices": [
                    {
                        "Text": "How do I leave?",
                        "Target": "talk"
                    },
                    {
                        "Text": "exit",
                        "Target": "City Square",
                        "Type": "Location"
                    }
                ],
                "Tags": [
                    "Talked to stranger"
                ]
            },
            "talk": {
                "Body": "<b>The Stranger</b><br>\"Of course,\" the stranger replies, enthusiastically, \"but first you must understand a little bit about where you are.\" The stranger repositions itself, now sort of lied back, relaxing before it explains. \"You must have noticed by now how similar this place is to where you came from. Any sci-fi nerd could have guessed 'mirror dimension!' But they'd be more right then they'd know. Everything here works in reflection, refraction. But like a reflection, things are not quite right. Reversed, reflected, mirrored, as it were. It follows then, that in order to return home, you must be able to see true again. There is a setup of mirrors called a non-reversing mirror, or more commonly a true mirror. It involves placing two mirrors angled towards each other so the light bounces from you, to one, to the other, back to you. In doing so it flips the image of yourself twice, resulting in it being your true image again, the one which the world around you sees, not the mirrored version only you've ever seen. You need to create a true mirror large enough for you to set up back at the road where you first stepped into this world from, and then step back through it. If you do that, you will return home. Problem is, you need to find two you-sized mirrors, which is easier said then done.\" The stranger leans in, grinning fervently. \"So good luck.\"",
                "Choices": [
                    {
                        "Text": "exit",
                        "Target": "City Square",
                        "Type": "Location"
                    }
                ],
                "Tags": [
                    "Know Mirrors"
                ]
            }
        }
    }
}